Revit 2026 API

# SectionType Enumeration

---

Declares the section data type.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum SectionType
```
```vb
Public Enumeration SectionType
```
```cpp
public enum class SectionType
```
```fsharp
type SectionType
```

| Member name | Value | Description |
| --- | --- | --- |
| Body | 1 |  |
| Footer | 3 |  |
| Header | 0 |  |
| None | -1 |  |
| Summary | 2 |  |

#### Reference

Autodesk.Revit.DB Namespace